Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/local_and_regional_government/city_and_county_development_boards.html.txt.tmx
Source language: en
Languages: ga

source: Local community development committees
ga: Coistí forbartha pobail áitiúil

source: Under Section 36 of the Local Government Reform Act 2014, each local authority must establish a Local Community Development Committee (LCDC) and may establish more than one such committee if the Minister approves
ga: Faoi Alt 36 den Acht um Athchóiriú an Rialtais Áitiúil, 2014, tá ar gach údarás áitiúil Coiste Forbartha Pobail Áitiúil (CFPÁ) a bhunú agus féadfaidh sé breis agus coiste amháin den saghas sin a bhunú má fhaomhann an tAire amhlaidh

source: The aim of the LCDCs is to develop, co-ordinate and implement a coherent and integrated approach to local and community development
ga: Is é aidhm an CFPÁ chun cur chuige soiléir agus comhtháite a fhorbairt, a chomhordú agus a chur i bhfeidhm i leith forbairt áitiúil agus pobail

source: The membership of LCDCs includes members of the local authority, local authority staff, representatives of public bodies which provide services in the area; representatives of local community interests; local community representatives; and representatives of publicly funded or supported local development bodies
ga: Áirítear le ballraíocht an CFPÁ comhaltaí den údarás áitiúil, foireann an údaráis áitiúil, ionadaithe de chomhlachtaí poiblí a sholáthraíonn seirbhísí sa limistéar; ionadaithe de leasanna pobail áitiúil; ionadaithe den phobal áitiúil; agus ionadaithe de chomhlachtaí forbartha áitiúla atá cistithe go poiblí nó a dtugtar tacaíocht phoiblí dóibh

source: The majority of members must be from the non-statutory sector
ga: Ní mór go bhfuil tromlach na gcomhaltaí ón earnáil neamhreachtúil

source: The main function of an LCDC is to prepare, implement and monitor the community elements of the six-year local economic and community plan
ga: Is é príomhfheidhm an CFPÁ chun gnéithe pobail an phlean áitiúil agus eacnamaíochta pobail sé bliana a ullmhú, a chur i bhfeidhm agus monatóireacht a dhéanamh orthu

source: It must consider the economic elements of the plan in order to enhance co-ordination with the community elements and ultimately integrate the two elements but it does not have a role in deciding on the economic elements
ga: Ní mór don CFPÁ breithniú a dhéanamh ar ghnéithe eacnamaíochta an phlean chun feabhas a chur ar chomhordú i dtaobh na ngnéithe pobail agus, ar deireadh, chun an dá ghné a chomhtháthú, ach ní bhíonn ról aige chun cinneadh a dhéanamh ar na gnéithe eacnamaíochta

source: It has a general role in seeking to ensure effectiveness, consistency, co-ordination and avoidance of duplication between the various elements of local authority activities in the community
ga: Tá ról ginearálta aige chun éifeachtacht, comhsheasmhacht, comhordú agus seachaint dúblála a chinntiú idir na gnéithe éagsúla gníomhaíochtaí údaráis áitiúil sa phobal

source: The local economic and community plan must be consistent with the local development plans made by the elected members and with the regional spatial and economic strategies
ga: Ní mór go mbeidh an plean áitiúil eacnamaíochta agus pobail a bheith comhsheasmhach leis na pleananna forbartha áitiúla a rinne na comhaltaí tofa agus leis na straitéisí réigiúnacha spásúlachta agus eacnamaíochta

source: The plan must be considered by the municipal district members and approved by the council
ga: Ní mór go ndéanfaidh comhaltaí an cheantair bhardasaigh breithniú ar an bplean agus caithfidh an chomhairle é a fhaomhadh

source: County and City Development Boards
ga: Boird Forbartha Contae agus Cathrach

source: County and City Development Boards (CDBs) were established in 2000 in each local authority area to bring together the key agencies and bodies in the area to engage in long-term planning
ga: Bunaíodh Boird Forbartha Contae agus Cathrach (BFCanna) in 2000 i ngach limistéar údaráis áitiúil chun na príomhghníomhaireachtaí agus na príomhchomhlachtaí a thabhairt le chéile chun tabhairt faoi phleanáil fhadtéarmach

source: They were abolished in June 2014 under the 2014 Act
ga: Cuireadh deireadh leo i Meitheamh 2014 faoi Acht 2014

source: Where appropriate, local and community development activity previously undertaken by the CDBs comes within the remit of new Local Community Development Committees
ga: Sa chás gur cuí, tagann an ghníomhaíocht forbartha áitiúil agus pobail faoinar thug na BFCanna roimhe seo laistigh de shainchúram na gCoistí Forbartha Pobail Áitiúil nua

source: Further information on the alignment of local government and local development is available from the Department of Housing, Planning, Community and Local Government
ga: Tá fáil ar bhreis faisnéise ar ailíniú forbairt an rialtais áitiúil agus forbartha áitiúla ón Roinn Comhshaoil, Pobail agus Rialtais Áitiúil
